var hocba = [
    [
        '7220201',
        'Ngôn ngữ Anh',
        '',
        '',
        '',
        '26.6',
        '',
        '',
        'Năm 2019, 2021 chỉ nhận HSG và CCNN'
    ],
    [
        '7220201C',
        'Ngôn ngữ Anh CLC',
        '',
        '24',
        '',
        '21.4',
        '',
        '22.5',
        ''
    ],
    [
        '7220204',
        'Ngôn ngữ Trung Quốc',
        '',
        '26.25',
        '',
        '25.8',
        '',
        '',
        'Năm 2019 chỉ nhận HSG'
    ],
    [
        '7220204C',
        'Ngôn ngữ Trung Quốc CLC',
        '',
        '20',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7220209',
        'Ngôn ngữ Nhật',
        '',
        '23.75',
        '',
        '23.3',
        '',
        '25.5',
        ''
    ],
    [
        '7220209C',
        'Ngôn ngữ Nhật CLC',
        '',
        '20',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7220210',
        'Ngôn ngữ Hàn Quốc',
        '',
        '24.75',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7310101',
        'Kinh tế',
        '',
        '25.4',
        '',
        '23.9',
        '',
        '26',
        ''
    ],
    [
        '7340101',
        'Quản trị kinh doanh',
        '',
        '',
        '',
        '26.6',
        '',
        '',
        'Năm 2019, 2021 chỉ nhận HSG và CCNN'
    ],
    [
        '7340101C',
        'Quản trị kinh doanh CLC',
        '',
        '22',
        '',
        '20',
        '',
        '21.5',
        ''
    ],
    [
        '7340115',
        'Marketing',
        '26',
        '',
        '25.3',
        '',
        '',
        '',
        'Năm 2019 chỉ nhận HSG'
    ],
    [
        '7340120',
        'Kinh doanh quốc tế',
        '25.25',
        '',
        '25.9',
        '',
        '',
        '',
        'Năm 2019 chỉ nhận HSG'
    ],
    [
        '7510605',
        'Logistics và Quản lý chuỗi cung ứng',
        '26.3',
        '',
        '25.1',
        '',
        '',
        '',
        ''
    ],
    [
        '7810101',
        'Du lịch',
        '',
        '25.75',
        '',
        '25.2',
        '',
        '',
        ''
    ],
    [
        '7340201',
        'Tài chính – Ngân hàng',
        '',
        '26.5',
        '',
        '25',
        '',
        '26.3',
        ''
    ],
    [
        '7340201C',
        'Tài chính – Ngân hàng CLC',
        '',
        '20',
        '',
        '20',
        '',
        '20',
        ''
    ],
    [
        '7340301',
        'Kế toán',
        '',
        '25.75',
        '',
        '25',
        '',
        '26.3',
        ''
    ],
    [
        '7340301C',
        'Kế toán CLC',
        '',
        '20',
        '',
        '20',
        '',
        '20',
        ''
    ],
    [
        '7340302',
        'Kiểm toán',
        '',
        '25.35',
        '',
        '24',
        '',
        '25.5',
        ''
    ],
    [
        '7340404',
        'Quản trị nhân lực',
        '',
        '',
        '',
        '',
        '',
        '27.5',
        'Năm 2020, 2021 nhận HSG và ưu tiên CCNN'
    ],
    [
        '7340405',
        'Hệ thống thông tin quản lý',
        '',
        '22.75',
        '',
        '20',
        '',
        '21.5',
        ''
    ],
    [
        '7380101',
        'Luật',
        '',
        '23.9',
        '',
        '23.5',
        '',
        '',
        'Năm 2019 chỉ nhận HSG'
    ],
    [
        '7380107',
        'Luật kinh tế',
        '',
        '24.8',
        '',
        '23.5',
        '',
        '',
        'Năm 2019 chỉ nhận HSG'
    ],
    [
        '7380107C',
        'Luật kinh tế CLC',
        '',
        '21.25',
        '',
        '20',
        '',
        '',
        'Năm 2019 chỉ nhận HSG'
    ],
    [
        '7420201',
        'Công nghệ sinh học',
        '',
        '18',
        '',
        '18',
        '',
        '20',
        ''
    ],
    [
        '7420201C',
        'Công nghệ sinh học CLC',
        '',
        '18',
        '',
        '18',
        '',
        '20',
        ''
    ],
    [
        '7540101',
        'Công nghệ thực phẩm',
        '',
        '23',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7480101',
        'Khoa học máy tính',
        '',
        '22.75',
        '',
        '20',
        '',
        '23.5',
        ''
    ],
    [
        '7480101C',
        'Khoa học máy tính CLC',
        '',
        '20',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7480201',
        'Công nghệ thông tin',
        '',
        '25.25',
        '',
        '23.8',
        '',
        '25.5',
        ''
    ],
    [
        '7510102',
        'CNKT công trình xây dựng',
        '',
        '20',
        '',
        '20',
        '',
        '20',
        ''
    ],
    [
        '7510102C',
        'CNKT công trình xây dựng CLC',
        '',
        '20',
        '',
        '20',
        '',
        '20',
        ''
    ],
    [
        '7580302',
        'Quản lý xây dựng',
        '',
        '20',
        '',
        '20',
        '',
        '20',
        ''
    ],
    [
        '7310620',
        'Đông Nam Á học',
        '',
        '18',
        '',
        '21.5',
        '',
        '22.5',
        ''
    ],
    [
        '7310301',
        'Xã hội học',
        '',
        '18',
        '',
        '22',
        '',
        '20',
        ''
    ],
    [
        '7760101',
        'Công tác xã hội',
        '',
        '18',
        '',
        '18',
        '',
        '20',
        ''
    ]
]

var diemthi = [
    [
        '7220201',
        'Ngôn ngữ Anh',
        '26.8',
        '24.75',
        '22.85',
        '20.4',
        '23.5',
        ''
    ],
    [
        '7220201C',
        'Ngôn ngữ Anh CLC',
        '25.9',
        '23.25',
        '21.2',
        '19',
        '22',
        ''
    ],
    [
        '7220204',
        'Ngôn ngữ Trung Quốc',
        '26.1',
        '24.25',
        '21.95',
        '19.85',
        '22.25',
        ''
    ],
    [
        '7220204C',
        'Ngôn ngữ Trung Quốc CLC',
        '25.75',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7220209',
        'Ngôn ngữ Nhật',
        '25.9',
        '23.75',
        '21.1',
        '19.65',
        '23',
        ''
    ],
    [
        '7220209C',
        'Ngôn ngữ Nhật CLC',
        '24.9',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7220210',
        'Ngôn ngữ Hàn Quốc',
        '26.7',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7310101',
        'Kinh tế',
        '25.8',
        '24.1',
        '20.65',
        '18.7',
        '21.25',
        ''
    ],
    [
        '7340101',
        'Quản trị kinh doanh',
        '26.4',
        '21.65',
        '18.3',
        '26.6',
        '17.2',
        '18.75'
    ],
    [
        '7340101C',
        'Quản trị kinh doanh CLC',
        '26.4',
        '21.65',
        '18.3',
        '17.2',
        '18.75',
        ''
    ],
    [
        '7340115',
        'Marketing',
        '26.95',
        '25.35',
        '25.3',
        '21.85',
        '',
        ''
    ],
    [
        '7340120',
        'Kinh doanh quốc tế',
        '26.45',
        '25.05',
        '22.75',
        '20.65',
        '23',
        ''
    ],
    [
        '7510605',
        'Logistics và Quản lý chuỗi cung ứng',
        '26.8',
        '24.35',
        '',
        '',
        '',
        ''
    ],
    [
        '7810101',
        'Du lịch',
        '24.5',
        '22',
        '',
        '',
        '',
        ''
    ],
    [
        '7340201',
        'Tài chính – Ngân hàng',
        '25.85',
        '24',
        '20.6',
        '18',
        '21',
        ''
    ],
    [
        '7340201C',
        'Tài chính – Ngân hàng CLC',
        '25.25',
        '18.5',
        '15.5',
        '15.25',
        '15.5',
        ''
    ],
    [
        '7340301',
        'Kế toán',
        '25.7',
        '23.8',
        '20',
        '18.2',
        '21.25',
        ''
    ],
    [
        '7340301C',
        'Kế toán CLC',
        '24.15',
        '16.5',
        '15.8',
        '15.25',
        '15.5',
        ''
    ],
    [
        '7340302',
        'Kiểm toán',
        '25.2',
        '23.8',
        '20',
        '18.2',
        '21.25',
        ''
    ],
    [
        '7340404',
        'Quản trị nhân lực',
        '26.25',
        '25.05',
        '21.65',
        '19.5',
        '21.75',
        ''
    ],
    [
        '7340405',
        'Hệ thống thông tin quản lý',
        '25.9',
        '23.2',
        '18.9',
        '16.1',
        '19.5',
        ''
    ],
    [
        '7380101',
        'Luật',
        '25.2',
        '22.8',
        '19.65',
        '18.55',
        '22.25',
        'Tổ hợp C00 cao hơn 1,5 điểm'
    ],
    [
        '7380107',
        'Luật kinh tế',
        '25.7',
        '23.55',
        '20.55',
        '19.25',
        '22.75',
        'Tổ hợp C00 cao hơn 1,5 điểm'
    ],
    [
        '7380107C',
        'Luật kinh tế CLC',
        '25.1',
        '19.2',
        '16',
        '17',
        '19',
        ''
    ],
    [
        '7420201',
        'Công nghệ sinh học',
        '16',
        '16',
        '15',
        '15',
        '18.5',
        ''
    ],
    [
        '7420201C',
        'Công nghệ sinh học CLC',
        '16',
        '16',
        '15',
        '15',
        '',
        ''
    ],
    [
        '7540101',
        'Công nghệ thực phẩm',
        '19',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7480101',
        'Khoa học máy tính',
        '25.55',
        '23',
        '19.2',
        '17',
        '20.75',
        ''
    ],
    [
        '7480101C',
        'Khoa học máy tính CLC',
        '24',
        '',
        '',
        '',
        '',
        ''
    ],
    [
        '7480201',
        'Công nghệ thông tin',
        '26.1',
        '24.5',
        '20.85',
        '18.25',
        '',
        ''
    ],
    [
        '7510102',
        'CNKT công trình xây dựng',
        '17',
        '16',
        '15.5',
        '15',
        '18.25',
        ''
    ],
    [
        '7510102C',
        'CNKT công trình xây dựng CLC',
        '16',
        '16',
        '15.3',
        '15',
        '',
        ''
    ],
    [
        '7580302',
        'Quản lý xây dựng',
        '19',
        '16',
        '15.5',
        '15',
        '17.5',
        ''
    ],
    [
        '7310620',
        'Đông Nam Á học',
        '23.1',
        '21.75',
        '18.2',
        '16.7',
        '20.25',
        ''
    ],
    [
        '7310301',
        'Xã hội học',
        '23.1',
        '19.5',
        '15.5',
        '15',
        '18.75',
        ''
    ],
    [
        '7760101',
        'Công tác xã hội',
        '18.8',
        '16',
        '15.5',
        '15',
        '17.5',
        ''
    ]
]

$(window).on('load', function () {
    $('#basic-datatables').DataTable({
        stateSave: true,
        data: hocba,
        "lengthMenu": [
            [5, 10, 15, 20, 25, -1],
            [5, 10, 15, 20, 25, "Tất cả"]
        ],
        "oLanguage": {
            "sSearch": "Tìm kiếm ngành",
            "sLengthMenu": "Hiển thị _MENU_ dòng",
            "sInfo": "Đang hiện thị dòng _START_ đến _END_ trong _TOTAL_ dòng",
            "sInfoFiltered": " - lọc từ _MAX_ dòng",
            "sInfoEmpty": "Không tìm thấy dữ liệu",
            "oPaginate": {
                "sPrevious": "<<",
                "sNext": ">>"
            }
        },
        language: {
            search: "_INPUT_",
            searchPlaceholder: "Search..."
        }
    });

    $('#basic-datatables-dt').DataTable({
        stateSave: true,
        data: diemthi,
        "lengthMenu": [
            [5, 10, 15, 20, 25, -1],
            [5, 10, 15, 20, 25, "Tất cả"]
        ],
        "oLanguage": {
            "sSearch": "Tìm kiếm ngành",
            "sLengthMenu": "Hiển thị _MENU_ dòng",
            "sInfo": "Đang hiện thị dòng _START_ đến _END_ trong _TOTAL_ dòng",
            "sInfoFiltered": " - lọc từ _MAX_ dòng",
            "sInfoEmpty": "Không tìm thấy dữ liệu",
            "oPaginate": {
                "sPrevious": "<<",
                "sNext": ">>"
            }
        }
    });
});